susanw1/zscript/receivers/native/arm/no-os/stm32f0/src/main/c++/arm-no-os/stm32f0/serial-module/lowlevel/specific/UartManagercpp.hpp
/*
 * Zcode Library - Command System for Microcontrollers)
 * Copyright (c) 2022 Zcode team (Susan Witts, Alicia Witts)
 *
 * SPDX-License-Identifier: MIT
 */

#ifndef SRC_MAIN_CPP_ARM_NO_OS_STM32F0_SERIAL_MODULE_LOWLEVEL_SPECIFIC_UARTMANAGERCPP_HPP_
#define SRC_MAIN_CPP_ARM_NO_OS_STM32F0_SERIAL_MODULE_LOWLEVEL_SPECIFIC_UARTMANAGERCPP_HPP_

#include "UartInternal.hpp"
#include <arm-no-os/system/interrupt/InterruptManager.hpp>

#define UART_TX_Inner(UART,PIN) UART##_TX_##PIN
#define UART_TX(UART,PIN) UART_TX_Inner(UART, PIN)

#define UART_RX_Inner(UART,PIN) UART##_RX_##PIN
#define UART_RX(UART,PIN) UART_RX_Inner(UART, PIN)

#if defined(STM32F030x6)
#include <arm-no-os/stm32f030x6/serial-module/lowlevel/specific/UartPins.hpp>
#elif defined(STM32F030x8)
#include <arm-no-os/stm32f030x8/serial-module/lowlevel/specific/UartPins.hpp>
#elif defined(STM32F031x6)
#include <arm-no-os/stm32f031x6/serial-module/lowlevel/specific/UartPins.hpp>
#elif defined(STM32F038xx)
#include <arm-no-os/stm32f038/serial-module/lowlevel/specific/UartPins.hpp>
#elif defined(STM32F042x6)
#include <arm-no-os/stm32f042x6/serial-module/lowlevel/specific/UartPins.hpp>
#elif defined(STM32F048xx)
#include <arm-no-os/stm32f048/serial-module/lowlevel/specific/UartPins.hpp>
#elif defined(STM32F051x8)
#include <arm-no-os/stm32f051x8/serial-module/lowlevel/specific/UartPins.hpp>
#elif defined(STM32F058xx)
#include <arm-no-os/stm32f058/serial-module/lowlevel/specific/UartPins.hpp>
#elif defined(STM32F070x6)
#include <arm-no-os/stm32f070x6/serial-module/lowlevel/specific/UartPins.hpp>
#elif defined(STM32F070xB)
#include <arm-no-os/stm32f070xb/serial-module/lowlevel/specific/UartPins.hpp>
#elif defined(STM32F071xB)
#include <arm-no-os/stm32f071xb/serial-module/lowlevel/specific/UartPins.hpp>
#elif defined(STM32F072xB)
#include <arm-no-os/stm32f072xb/serial-module/lowlevel/specific/UartPins.hpp>
#elif defined(STM32F078xx)
#include <arm-no-os/stm32f078/serial-module/lowlevel/specific/UartPins.hpp>
#elif defined(STM32F091xC)
#include <arm-no-os/stm32f091xc/serial-module/lowlevel/specific/UartPins.hpp>
#elif defined(STM32F098xx)
#include <arm-no-os/stm32f098/serial-module/lowlevel/specific/UartPins.hpp>
#elif defined(STM32F030xC)
#include <arm-no-os/stm32f030xc/serial-module/lowlevel/specific/UartPins.hpp>
#else
#error "Please select the target STM32F0xx device used in your application"
#endif

#ifdef USE_UART_1
#if !UART_TX(_UART_1, UART_1_TX)
#error  Not defined as a valid UART 1 TX pin: UART_1_TX
#endif
#if !UART_RX(_UART_1, UART_1_RX)
#error  Not defined as a valid UART 1 RX pin: UART_1_RX
#endif
#endif

#ifdef USE_UART_2
#if !UART_TX(_UART_2, UART_2_TX)
#error  Not defined as a valid UART 2 TX pin: UART_2_TX
#endif
#if !UART_RX(_UART_2, UART_2_RX)
#error  Not defined as a valid UART 2 RX pin: UART_2_RX
#endif
#endif

#ifdef USE_UART_3
#if !UART_TX(_UART_3, UART_3_TX)
#error  Not defined as a valid UART 3 TX pin: UART_3_TX
#endif
#if !UART_RX(_UART_3, UART_3_RX)
#error  Not defined as a valid UART 3 RX pin: UART_3_RX
#endif
#endif

#ifdef USE_UART_4
#if !UART_TX(_UART_4, UART_4_TX)
#error  Not defined as a valid UART 4 TX pin: UART_4_TX
#endif
#if !UART_RX(_UART_4, UART_4_RX)
#error  Not defined as a valid UART 4 RX pin: UART_4_RX
#endif
#endif

#ifdef USE_UART_5
#if !UART_TX(_UART_5, UART_5_TX)
#error  Not defined as a valid UART 5 TX pin: UART_5_TX
#endif
#if !UART_RX(_UART_5, UART_5_RX)
#error  Not defined as a valid UART 5 RX pin: UART_5_RX
#endif
#endif

#ifdef USE_UART_6
#if !UART_TX(_UART_6, UART_6_TX)
#error  Not defined as a valid UART 6 TX pin: UART_6_TX
#endif
#if !UART_RX(_UART_6, UART_6_RX)
#error  Not defined as a valid UART 6 RX pin: UART_6_RX
#endif
#endif

template<class LL>
Uart<LL> UartManager<LL>::uarts[] = {

#ifdef USE_UART_1
    Uart<LL>()
#endif
#ifdef USE_UART_2
    , Uart<LL>()
#endif
#ifdef USE_UART_3
    , Uart<LL>()
#endif
#ifdef USE_UART_4
    , Uart<LL>()
#endif
#ifdef USE_UART_5
    , Uart<LL>()
#endif
#ifdef USE_UART_6
    , Uart<LL>()
#endif
        };

template<class LL>
void UartManager<LL>::interrupt(uint8_t id) {
    UartManager < LL > ::uarts[id].interrupt();
}

template<class LL>
UartInternal<LL> getUartInternal(SerialIdentifier id) {
    if (id == 0) {
#ifdef USE_UART_1
        return UartInternal<LL>(UART_RX(UART_1, UART_1_RX), UART_TX(UART_1, UART_1_TX), (UartRegisters*) 0x40013800, id);
#else
        return UartInternal<LL>();
#endif
    } else if (id == 1) {
#ifdef USE_UART_2
        return UartInternal<LL>(UART_RX(UART_2, UART_2_RX), UART_TX(UART_2, UART_2_TX), (UartRegisters*) 0x40004400, id);
#else
        return UartInternal<LL>();
#endif
    } else if (id == 2) {
#ifdef USE_UART_3
        return UartInternal<LL>(UART_RX(UART_3, UART_3_RX), UART_TX(UART_3, UART_3_TX), (UartRegisters*) 0x40004800, id);
#else
        return UartInternal<LL>();
#endif
    } else if (id == 3) {
#ifdef USE_UART_4
        return UartInternal<LL>(UART_RX(UART_4, UART_4_RX), UART_TX(UART_4, UART_4_TX), (UartRegisters*) 0x40004C00, id);
#else
        return UartInternal<LL>();
#endif
    } else if (id == 4) {
#ifdef USE_UART_5
        return UartInternal<LL>(UART_RX(UART_5, UART_5_RX), UART_TX(UART_5, UART_5_TX), (UartRegisters*) 0x40005000, id);
#else
        return UartInternal<LL>();
#endif
    } else {
#ifdef USE_UART_6
        return UartInternal<LL>(UART_RX(UART_6, UART_6_RX), UART_TX(UART_6, UART_6_TX), (UartRegisters*) 0x40008000, id);
#else
        return UartInternal<LL>();
#endif
    }
}
template<class LL>
Dma<LL>* getUartDmaById(uint8_t id) {
    if (id == 0) {
        return DmaManager < LL > ::getDmaById(LL::uart1TxDma);
    } else {
        return DmaManager < LL > ::getDmaById(LL::uart2TxDma);
    }
}

template<class LL>
void UartManager<LL>::init() {
    InterruptManager::setInterrupt(&UartManager::interrupt, UartInt);
    for (int i = 0; i < HW::uartCount; ++i) {
        uarts[i].setUart(getUartInternal < LL > (i), getUartDmaById < LL > (i));
        InterruptManager::enableInterrupt(UartInt, i, 8);
    }
}

#endif /* SRC_MAIN_CPP_ARM_NO_OS_STM32F0_SERIAL_MODULE_LOWLEVEL_SPECIFIC_UARTMANAGERCPP_HPP_ */
